#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b15d82d17cbb836b0df49295e6ad752ed7f390c9]
local_file.tfkey: Refreshing state... [id=80ec7f9f618633d7dda8a28b157714f137f39c80]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-09e271f2a40e819ad]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_vpc.main: Refreshing state... [id=vpc-0c07268ba0b443d72]
data.aws_ami.java-ami: Reading...
data.aws_ami.java-ami: Read complete after 0s [id=ami-0682c047b301bbba1]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-073aac3c7e4d8ceb6]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0b5dee67d601449b3]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0630ac694853fd61f]
aws_security_group.elb: Refreshing state... [id=sg-0a55863e2ad7746c5]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0fc66c46ce67496f4]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0664564b0d519526d]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0f7cc86bf3419a8e1]
aws_security_group.allow_http: Refreshing state... [id=sg-0577f0597de4f138e]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0d18c6475ae36ddb2]
aws_instance.bastion-host: Refreshing state... [id=i-0e75fa67d11aef6ad]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0abbc25a0b1c3c42a]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table.private_route_table: Refreshing state... [id=rtb-001e6b501e24215a9]
aws_launch_template.ec2_config: Refreshing state... [id=lt-0bd6540c0ae9e04a7]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0b48950158a7d4493]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0126a5b29fb354d4e]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0faafa2a1cec57a0c]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-06126b7fae9b65064]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230202153128905700000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0bd6540c0ae9e04a7"
            name    = "terraform-20230202153017835700000001"
          ~ version = "1" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_instance.bastion-host will be updated in-place
  ~ resource "aws_instance" "bastion-host" {
        id                                   = "i-0e75fa67d11aef6ad"
      ~ tags                                 = {
          + "Name" = "Bastion Host"
        }
      ~ tags_all                             = {
          + "Name" = "Bastion Host"
        }
        # (29 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0bd6540c0ae9e04a7"
      ~ image_id                = "ami-0b008a7b21379ab32" -> "ami-0682c047b301bbba1"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "terraform-20230202153017835700000001"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*